app/controllers/tweets_controller.rb

SELECT "tweets".* FROM "tweets"
---
  def index
    @tweets = Tweet.all

SELECT "tweets".* FROM "tweets" WHERE "tweets"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
  def show
    @tweet = Tweet.find(params[:id])

SELECT "tweets".* FROM "tweets" WHERE "tweets"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
  def edit
    @tweet = Tweet.find(params[:id])

INSERT INTO "tweets" ("user_id", "content", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 1], ["content", "un tweet"], ["created_at", "2023-02-20 19:55:01.089660"], ["updated_at", "2023-02-20 19:55:01.089660"]]
---
  def create
    @tweet = Tweet.new(tweet_params)

    respond_to do |format|
      if @tweet.save

UPDATE "tweets" SET "content" = ?, "updated_at" = ? WHERE "tweets"."id" = ?  [["content", "un tweet"], ["updated_at", "2023-02-20 20:06:23.083334"], ["id", 5]]
---
  def update
    respond_to do |format|
      if @tweet.update(tweet_params)

SELECT "tweets".* FROM "tweets" WHERE "tweets"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
DELETE FROM "tweets" WHERE "tweets"."id" = ?  [["id", 1]]
---
  def destroy
    @tweet = Tweet.find(params[:id])
    @tweet.destroy

SELECT "tweets".* FROM "tweets" WHERE "tweets"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
---
    def set_tweet
      @tweet = Tweet.find(params[:id])